# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
# ВВЕДЕНИЕ. ДОМАШНЕЕ ЗАДАНИЕ
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
# Написать программу на языке Python для демонстрации базовых структур данных.
# Даны числа:
#
# 1.	23891471923807487.142352314353455
# 2.	23891471923807487.142352314356734
# 3.	23891471923843245.142352314334563
# 4.	23891471923843245.142352314334553
#
# Нужно проверить что сумма 1-го и 3-го числа больше суммы 2-го и 4-го.
# Результат должен получиться False (Ложь).
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
# Программа :

a1 = 23891471923807487.142352314353455
b2 = 23891471923807487.142352314356734
a3 = 23891471923843245.142352314334563
b4 = 23891471923843245.142352314334553
suma = a1 + a3
sumb = b2 + b4
print(suma > sumb)
