# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
# ОРГАНИЗАЦИЯ ПРОГРАММ И МЕТОДЫ СТРОК. ДОМАШНЕЕ ЗАДАНИЕ
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
# 1)	создать переменную my_string и присвоить ей значение с помощью input ();
# 2)	вывести на экран длину строки;
# 3)	вывести строку my_string в верхнем регистре;
# 4)	вывести строку my_string в нижнем регистре;
# 5)	изменить строку my_string, удалив все пробелы;
# 6)	вывести первый символ строки my_string;
# 7)	вывести последний символ строки my_string.
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
# Программа :

my_string = input("Введите строку : ")
print('Вы напечатали  =', my_string)
print('upper()        =', my_string.upper())
print('lower()        =', my_string.lower())
new_string = my_string.replace(' ', '')
print('remove spaces  =', new_string)
print('first letter   =', my_string[0])
print('last letter    =', my_string[-1])

