# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
# ПЕРЕМЕННЫЕ. ДОМАШНЕЕ ЗАДАНИЕ
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
# 1)	создайте переменную num1 и присвойте ей значение 5;
# 2)	создайте переменную num2 и присвойте ей значение 3;
# 3)	создайте переменную sum и присвойте ей сумму num1 и num2;
# 4)	выведите значение переменной sum на экран;
# 5)	создайте переменную result и присвойте ей результат выражения sum + num1 * num2;
# 6)	выведите значение переменной result на экран.
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
# Программа :

num1 = 5
num2 = 3
sum = num1 + num2
print('sum    =', sum)
result = sum + num1 * num2
print('result =', result)
