# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
# ЦИКЛ FOR. ДОМАШНЕЕ ЗАДАНИЕ
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
# 1)	создать список из 5 машин ["BMW", "MB", "LADA", "KIA", "HONDA"];
# 2)	в цикле for распечатать каждый автомобиль в строке 'Я езжу на автомобиле марки';
# 3)	создать целочисленную переменную cars_count = 0;
# 4)	в цикле for начиная с шага номер 2 выполнить увеличение переменной на 10 (cars_count += 10).
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
# Программа :
# -*- coding: utf-8 -*-

car_marks = ["BMW", "MB", "LADA", "KIA", "HONDA"]

for i in range(len(car_marks)):
    print('я езжу на автомобиле', car_marks[i])

cars_count = 0

for i in range(len(car_marks)):
    if i > 1:
        cars_count += 10
    print(cars_count)
