# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
# ДИНАМИЧЕСКАЯ ТИПИЗАЦИЯ. ДОМАШНЕЕ ЗАДАНИЕ
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
# 1)	создать переменную name и присвоить ей значение вашего имени (строка);
# 2)	вывести значение переменной name на экран;
# 3)	создать переменную age и присвоить ей значение вашего возраста (целое число).
# 4)	вывести значение переменной age на экран;
# 5)	изменить значение переменной age на новое значение (например, age + 1).
# 6)	вывести измененное значение переменной age на экран;
# 7)	создать переменную is_student и присвоить ей значение True (логическое значение).
# 8)	вывести значение переменной is_student на экран.
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
# Программа :
# -*- coding: utf-8 -*-

name = 'Alex'
print('Name     =', name)
age = 55
print('Age      =', age)
age = age - 10
print('New age  =', age)
is_student = True
print(is_student)
